{
    "1": {
    "description": "Le nombre 1 représente l'unité, l'origine et le commencement. Il symbolise la source de toutes choses.",
    "keywords": ["unité", "origine", "commencement"]
    },
    "2": {
    "description": "Le nombre 2 représente le dualisme, la polarité et l'opposition. Il reflète les concepts de masculin/féminin, lumière/obscurité, positif/négatif, etc.",
    "keywords": ["dualisme", "polarité", "opposition"]
    },
    "3": {
    "description": "Le nombre 3 est associé à la perfection, l'harmonie et la stabilité. Il est lié à la triade divine et représente le principe d'équilibre.",
    "keywords": ["perfection", "harmonie", "stabilité"]
    },
    "4": {
    "description": "Le nombre 4 est lié au matériel et à la manifestation physique. Il symbolise les quatre éléments classiques (terre, air, feu et eau) et les quatre directions cardinales.",
    "keywords": ["matériel", "manifestation physique", "éléments classiques"]
    },
    "5": {
    "description": "Le nombre 5 est associé à l'humain, au corps et aux cinq sens. Il représente l'adaptation, la volonté et la force vitale.",
    "keywords": ["humain", "corps", "cinq sens"]
    },
    "6": {
    "description": "Le nombre 6 est lié à l'harmonie et à la beauté. Il symbolise l'union de l'esprit et du corps et est considéré comme le nombre de la perfection en tant que somme de ses facteurs propres (1 + 2 + 3 = 6).",
    "keywords": ["harmonie", "beauté", "perfection"]
    },
    "7": {
    "description": "Le nombre 7 est associé à la spiritualité, la réflexion et la sagesse. Il est un nombre de puissance et d'éveil spirituel.",
    "keywords": ["spiritualité", "réflexion", "sagesse"]
    },
    "8": {
    "description": "Le nombre 8 est lié au renouvellement et à l'infini. Il représente les cycles de la vie et de la mort et symbolise le pouvoir manifesté dans l'univers matériel.",
    "keywords": ["renouvellement", "infini", "cycles de vie et mort"]
    },
    "9": {
    "description": "Le nombre 9 est associé à la fin d'un cycle et à la complétude. Il représente l'accomplissement, la réalisation et la compassion.",
    "keywords": ["fin de cycle", "complétude", "accomplissement"]
    }
    }
    