{
    "modelName": "DevelopmentProcess-Model",
    "description": "A Gantt-style project model outlining the development phases for a web project, designed to guide mentors in assisting mentees through each phase.",
    "context": "As a mentor, guide your mentee through the development phases of a web project, ensuring they understand and complete each task required for successful project completion.",
    "objective": "To provide a structured and sequential approach to web development, facilitating efficient and comprehensive project execution.",
    "steps": [
      {
        "phase": 1,
        "title": "Récupérer dynamiquement les données des travaux via l’API",
        "tasks": [
          "Comprendre les endpoints de l'API",
          "Configurer les requêtes API dans le code",
          "Traiter et afficher les données récupérées"
        ]
      },
      {
        "phase": 2,
        "title": "Ajouter le tri des projets par catégorie dans la galerie",
        "tasks": [
          "Définir les catégories de projets",
          "Implémenter la logique de filtrage côté client",
          "Tester le tri avec divers jeux de données"
        ]
      },
      {
        "phase": 3,
        "title": "Intégrer la page de connexion pour le site",
        "tasks": [
          "Créer le formulaire de connexion",
          "Mettre en place l'authentification côté serveur",
          "Gérer les sessions utilisateur"
        ]
      },
      {
        "phase": 4,
        "title": "Ajouter la modale pour gérer les projets",
        "tasks": [
          "Concevoir l'interface utilisateur de la modale",
          "Implémenter les fonctionnalités CRUD pour les projets",
          "Assurer la sécurité des opérations de gestion des projets"
        ]
      },
      {
        "phase": 5,
        "title": "Créer le formulaire pour l’ajout de projet",
        "tasks": [
          "Définir les champs du formulaire nécessaires",
          "Valider les entrées côté client",
          "Connecter le formulaire à l'API pour la soumission des données"
        ]
      },
      {
        "phase": 6,
        "title": "Faire la version 2 de l’API",
        "tasks": [
          "Évaluer les améliorations nécessaires par rapport à la version 1",
          "Développer de nouveaux endpoints selon les besoins",
          "Tester la compatibilité ascendante avec la version existante du site"
        ]
      },
      {
        "phase": 7,
        "title": "Designer la version mobile du site de l’Architecte",
        "tasks": [
          "Adapter le design aux petits écrans",
          "Optimiser les performances pour les appareils mobiles",
          "Effectuer des tests d'usabilité sur différents appareils"
        ]
      },
      {
        "phase": 8,
        "title": "RDV Client : Présentation de la version 1 du site avec administration des projets",
        "tasks": [
          "Préparer une démonstration complète du site",
          "Recueillir les feedbacks du client",
          "Planifier les prochaines étapes en fonction des retours"
        ]
      }
    ],
    "features": {
      "structuredApproach": "Provides a clear, step-by-step guide for project development, ensuring no critical tasks are overlooked.",
      "mentorGuidance": "Facilitates mentor involvement at each phase, offering opportunities for teaching and clarification.",
      "progressTracking": "Enables easy tracking of project progress against the planned Gantt-style phases and tasks."
    }
  }
  